In [21]:
# Dependencies and Setup
import pandas as pd
from pathlib import Path

# File to Load (Remember to Change These)
school_data_to_load = Path("Resources/schools_complete.csv")
student_data_to_load = Path("Resources/students_complete.csv")

# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [22]:
# Calculate the total number of unique schools

school_count = school_data_complete["school_name"].unique()
unique_schools = len(school_count)
unique_schools

15

In [23]:
# Calculate the total number of students
student_count = school_data_complete["student_name"].count()
student_count

39170

In [24]:
# Calculate the total budget
total_budget_df = school_data_complete[["school_name","budget"]]
total_budget_df = total_budget_df.drop_duplicates()
total_budget = total_budget_df["budget"].sum()
total_budget

24649428

In [45]:
# Calculate the average (mean) math score
average_math_score = school_data_complete["math_score"].mean()
average_math_score

78.98537145774827

In [46]:
summary_table = pd.DataFrame([{"Total Schools": unique_schools, 
                               "Total Students": student_count, 
                               "Total Budget": total_budget,
                               "Average Math Score": average_math_score,
                               }])

summary_table.loc[:, "Total Students"] = summary_table["Total Students"].map('{:,.0f}'.format)
summary_table.loc[:, "Total Budget"] = "$" + summary_table["Total Budget"].map('{:,.2f}'.format)

summary_table

   Total Schools Total Students    Total Budget  Average Math Score
0             15         39,170  $24,649,428.00           78.985371